Revit 2024 API
BuiltInFailures.StairRampFailures.ContinuousRailGometryCreationFailure Property
 Cannot create the continuous rail geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ContinuousRailGometryCreationFailure { get; }
Visual Basic
Public Shared ReadOnly Property ContinuousRailGometryCreationFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ContinuousRailGometryCreationFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace